Revit 2026 API

# PathOfTravelFindShortestPaths Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<IList<XYZ>> FindShortestPaths(
	View DBView,
	IList<XYZ> destinationPoints,
	IList<XYZ> startPoints
)
```
```vb
Public Shared Function FindShortestPaths (
	DBView As View,
	destinationPoints As IList(Of XYZ),
	startPoints As IList(Of XYZ)
) As IList(Of IList(Of XYZ))
```
```cpp
public:
static IList<IList<XYZ^>^>^ FindShortestPaths(
	View^ DBView,
	IList<XYZ^>^ destinationPoints,
	IList<XYZ^>^ startPoints
)
```
```fsharp
static member FindShortestPaths :
        DBView : View *
        destinationPoints : IList<XYZ> *
        startPoints : IList<XYZ> -> IList<IList<XYZ>>
```

#### Parameters

DBView View

destinationPoints IListXYZ

startPoints IListXYZ

#### Return Value

IListIListXYZ

#### Reference

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace